# BuiltInFailures.EnergyAnalysisUtilitiesDBFailures Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
BuiltInFailures..::..EnergyAnalysisUtilitiesDBFailures Members
BuiltInFailures..::..EnergyAnalysisUtilitiesDBFailures Class Properties See Also
---
Provides a container of all Revit built-in FailureDefinitionId instances.
The BuiltInFailures..::..EnergyAnalysisUtilitiesDBFailures type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AimErrEmptyName | MassZone '%1' has empty name and id values which cannot be used as gbXML identifiers. |

# See Also
BuiltInFailures..::..EnergyAnalysisUtilitiesDBFailures Class
Autodesk.Revit.DB Namespace